USE EgyptTelecomAnalysis;
GO

-- بيانات جدول GovernorateSummary

INSERT INTO GovernorateSummary (governorate_en, governorate_ar, avg_d_kbps, avg_u_kbps, avg_lat_ms, avg_d_mbps, avg_u_mbps, total_tests, total_devices, tile_count) VALUES
('Alexandria', N'الإسكندرية', 28552, 9913, 48.1, 28.6, 9.9, 155411, 89901, 80),
('Aswan', N'أسوان', 19869, 7103, 63.5, 19.9, 7.1, 35161, 19155, 35),
('Asyut', N'أسيوط', 20476, 7375, 57.9, 20.5, 7.4, 33796, 19146, 35),
('Beheira', N'البحيرة', 19934, 8067, 61.4, 19.9, 8.1, 33297, 18598, 35),
('Beni Suef', N'بني سويف', 21835, 7442, 62.8, 21.8, 7.4, 33770, 19693, 35),
('Cairo', N'القاهرة', 28178, 10076, 48.9, 28.2, 10.1, 144487, 82117, 80),
('Dakahlia', N'الدقهلية', 20238, 7771, 64.6, 20.2, 7.8, 38916, 22381, 35),
('Damietta', N'دمياط', 20206, 7629, 56.9, 20.2, 7.6, 37619, 21499, 35),
('Fayyum', N'الفيوم', 19838, 7184, 58.7, 19.8, 7.2, 33777, 18937, 35),
('Gharbia', N'الغربية', 19121, 7239, 60.8, 19.1, 7.2, 32433, 18000, 35),
('Giza', N'الجيزة', 27866, 9866, 49.3, 27.9, 9.9, 156970, 92319, 80),
('Ismailia', N'الإسماعيلية', 19404, 7506, 65.9, 19.4, 7.5, 34708, 18845, 35),
('Kafr El-Sheikh', N'كفر الشيخ', 19076, 7667, 64.8, 19.1, 7.7, 37409, 21410, 35),
('Luxor', N'الأقصر', 19878, 7431, 60.9, 19.9, 7.4, 34412, 20330, 35),
('Matrouh', N'مطروح', 10850, 4103, 91.4, 10.8, 4.1, 2718, 1485, 12),
('Minya', N'المنيا', 20873, 7563, 62.2, 20.9, 7.6, 35380, 19762, 35),
('Monufia', N'المنوفية', 19826, 7885, 65.6, 19.8, 7.9, 35429, 19752, 35),
('New Valley', N'الوادي الجديد', 9009, 3964, 95.5, 9.0, 4.0, 2813, 1664, 12),
('North Sinai', N'شمال سيناء', 8845, 3992, 89.1, 8.8, 4.0, 2200, 1355, 12),
('Port Said', N'بورسعيد', 20288, 8051, 59.6, 20.3, 8.1, 35584, 21427, 35),
('Qalyubia', N'القليوبية', 20554, 7350, 59.4, 20.6, 7.4, 31730, 18385, 35),
('Qena', N'قنا', 20518, 7140, 59.7, 20.5, 7.1, 38055, 21163, 35),
('Red Sea', N'البحر الأحمر', 11071, 3875, 88.7, 11.1, 3.9, 3073, 1766, 12),
('Sharqia', N'الشرقية', 20057, 7946, 59.0, 20.1, 7.9, 34536, 20379, 35),
('Sohag', N'سوهاج', 20830, 7360, 63.5, 20.8, 7.4, 36593, 21093, 35),
('South Sinai', N'جنوب سيناء', 9922, 4423, 83.0, 9.9, 4.4, 2674, 1605, 12),
('Suez', N'السويس', 19633, 7402, 58.7, 19.6, 7.4, 30880, 17593, 35);
GO
